---
kind: method
id: M:Autodesk.Revit.DB.WorksetConfiguration.#ctor
source: html/455c470f-e5f9-461d-8641-4f363e386e26.htm
---
# Autodesk.Revit.DB.WorksetConfiguration.#ctor Method

Constructs a new workset configuration with an initial setting to open all user-created worksets.

## Syntax (C#)
```csharp
public WorksetConfiguration()
```